        IDENTIFICATION DIVISION.
        PROGRAM-ID. TWO.
        ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
        DATA DIVISION.
        FILE SECTION.
        PROCEDURE DIVISION.
           DISPLAY "TWO".
           STOP RUN.
